Extensions/УВМ/Documents/УченическийДоговор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>УченическийДоговор</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УВМ_ТипРасчетаВозмещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УВМ_ТипыРасчетаВозмещенияПоУченическимДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачалаОбязательств</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачалаУчебы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияОбязательств</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияУчебы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МероприятияОбученияРазвития</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Обязательства</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/УВМ/Enums/УВМ_ТипыРасчетаВозмещенияПоУченическимДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>УВМ_ТипыРасчетаВозмещенияПоУченическимДоговорам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Стандартный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропорциональноФактическиОтработанномуВремени</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/УВМ/Documents/УченическийДоговор/Ext/ManagerModule.bsl
// + БаринбергГМ 20220625 (9837)
// - БаринбергГМ 20220625 (9837)
&ИзменениеИКонтроль("ПолучитьДанныеДляПроведения")
Функция УВМ_ПолучитьДанныеДляПроведения(Ссылка)

#Вставка
Если Ссылка.УВМ_ТипРасчетаВозмещения = Перечисления.УВМ_ТипыРасчетаВозмещенияПоУченическимДоговорам.ПропорциональноФактическиОтработанномуВремени Тогда
	ДвиженияУсловийУченическогоДоговора = Новый ТаблицаЗначений;
	ДвиженияУсловийУченическогоДоговора.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ДвиженияУсловийУченическогоДоговора.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ДвиженияУсловийУченическогоДоговора.Колонки.Добавить("УченическийДоговор", Новый ОписаниеТипов("ДокументСсылка.УченическийДоговор"));
	//ДвиженияУсловийУченическогоДоговора.Колонки.Добавить("ДатаНачалаДоговора", Новый ОписаниеТипов("Дата"));
	//ДвиженияУсловийУченическогоДоговора.Колонки.Добавить("ПериодРаботы", Новый ОписаниеТипов("Дата"));
	ДвиженияУсловийУченическогоДоговора.Колонки.Добавить("ДатаНачалаОбязательств", Новый ОписаниеТипов("Дата"));
	ДвиженияУсловийУченическогоДоговора.Колонки.Добавить("ДатаОкончанияОбязательств", Новый ОписаниеТипов("Дата"));
	ДвиженияУсловийУченическогоДоговора.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	
	пСтоимостьМероприятия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка.Мероприятие, "Стоимость");
	пКоличествоДней = (Ссылка.ДатаОкончанияОбязательств - Ссылка.ДатаНачалаОбязательств) / (60 * 60 * 24);
	пКоличествоДнейДоОкончанияОбучения = 0;
	Для индекс = 0 по пКоличествоДней - 1 Цикл
		Движение = ДвиженияУсловийУченическогоДоговора.Добавить();
		Движение.Организация = Ссылка.Организация;
		Движение.ФизическоеЛицо = Ссылка.ФизическоеЛицо;
		Движение.УченическийДоговор = Ссылка;
		Движение.ДатаНачалаОбязательств = Ссылка.ДатаНачалаОбязательств + индекс * 60 * 60 * 24;
		Движение.ДатаОкончанияОбязательств = Движение.ДатаНачалаОбязательств + 60 * 60 * 24;
		Если Движение.ДатаНачалаОбязательств < Ссылка.ДатаОкончанияУчебы Тогда
			Движение.Сумма = пСтоимостьМероприятия;
			пКоличествоДнейДоОкончанияОбучения = пКоличествоДнейДоОкончанияОбучения + 1;
		Иначе
			Движение.Сумма = (пКоличествоДней - индекс) / (пКоличествоДней - пКоличествоДнейДоОкончанияОбучения) * пСтоимостьМероприятия;
		КонецЕсли;
	КонецЦикла;
Иначе
#КонецВставки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УченическийДоговор.Организация,
	|	УченическийДоговор.ФизическоеЛицо,
	|	УченическийДоговор.Ссылка КАК УченическийДоговор,
	|	УченическийДоговор.ДатаНачалаОбязательств КАК ДатаНачалаДоговора,
	|	УченическийДоговорОбязательства.ПериодРаботы КАК ПериодРаботы,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачалаОбязательств,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОкончанияОбязательств,
	|	УченическийДоговорОбязательства.Сумма
	|ИЗ
	|	Документ.УченическийДоговор.Обязательства КАК УченическийДоговорОбязательства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УченическийДоговор КАК УченическийДоговор
	|		ПО УченическийДоговорОбязательства.Ссылка = УченическийДоговор.Ссылка
	|ГДЕ
	|	УченическийДоговор.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодРаботы";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ДвиженияУсловийУченическогоДоговора = РезультатЗапроса.Выгрузить();

	ПредыдущееДвижение = Неопределено;
	Для каждого Движение Из ДвиженияУсловийУченическогоДоговора Цикл
		Если ПредыдущееДвижение = Неопределено Тогда
			Движение.ДатаНачалаОбязательств = Движение.ДатаНачалаДоговора;
		Иначе
			Движение.ДатаНачалаОбязательств = КонецДня(ПредыдущееДвижение.ДатаОкончанияОбязательств)+1;
		КонецЕсли;
		Движение.ДатаОкончанияОбязательств = НачалоДня(ДобавитьМесяц(Движение.ДатаНачалаДоговора, Движение.ПериодРаботы))-1;
		ПредыдущееДвижение = Движение;
	КонецЦикла;
#Вставка
КонецЕсли;
#КонецВставки

	ДанныеДляПроведения = Новый Структура;
	ДанныеДляПроведения.Вставить("ДвиженияУсловийУченическогоДоговора", ДвиженияУсловийУченическогоДоговора);

	Возврат ДанныеДляПроведения;

КонецФункции
